package myself01;

public class day02demo10 {
	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*企业发放的奖金根据利润提成。
* 利润低于或等于10万元时，奖金可提10%；
* 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
* 20万到40万之间时，高于20万元的部分，可提成5%；
* 40万到60万之间时高于40万元的部分，可提成3%；
* 60万到100万之间时，高于60万元的部分，可提成1.5%，
* 高于100万元时，超过100万元的部分按1%提成，
* 在程序中设定一个变量为当月利润，求应发放奖金总数？*/
		double i =10004564;
		double a =100000;
		double b =200000;
		double c =400000;
		double d =600000;
		double e =1000000;
		double f=0;
		if(i>d){
			f = (i-e)*0.01+100000*(4*0.015+2*0.03+2*0.05+1*0.075+1*0.1);
		}
		else if(i>d){
			f=(i-d)*0.015+100000*(2*0.03+2*0.05+1*0.075+1*0.1);
		}	
		else if(i>c){
			f=(i-c)*0.03+100000*(2*0.05+1*0.075+1*0.1);
		}	
		else if(i>b){
			f=(i-b)*0.05+100000*(1*0.075+1*0.1);
	}
		else if(i>a){
			f=(i-a)*0.075+100000*(1*0.1);
}
		else{
			f=1*0.1;
		}
		System.out.println(f);
		
		
		
		int p = 1234;
		   int c1=p/1000%10;
		   int c2=p/100%10;
		   int c3=p/10%10;
		   int c4=p/1%10;
		   int c5=c4*1000+c3*100+c2*10+c1*1;
		   System.out.println(c5);
}
}
